{
  "slug": "bangalore",
  "name": "Bangalore",
  "state": "Karnataka",
  "keywords": [
    "Bangalore travel guide",
    "Bengaluru tourism",
    "things to do in Bangalore",
    "Bangalore attractions",
    "places to visit Bangalore",
    "explore Bangalore",
    "Bangalore city guide",
    "Silicon Valley of India",
    "Garden City India",
    "IT capital India",
    "Lalbagh Botanical Garden",
    "Bangalore Palace",
    "Cubbon Park Bangalore",
    "ISKCON Temple Bangalore",
    "Vidhana Soudha",
    "Bangalore tourist spots",
    "Bangalore sightseeing",
    "Bangalore weather",
    "Nandi Hills Bangalore",
    "Nandi Hills sunrise",
    "Bangalore parks gardens",
    "Bangalore cafes",
    "Bangalore cafe culture",
    "Bangalore nightlife",
    "pubs in Bangalore",
    "Bangalore breweries",
    "craft beer Bangalore",
    "Koramangala Bangalore",
    "Indiranagar Bangalore",
    "Whitefield Bangalore",
    "MG Road Bangalore",
    "Brigade Road Bangalore",
    "Masala Dosa Bangalore",
    "South Indian food Bangalore",
    "MTR Bangalore",
    "Vidyarthi Bhavan",
    "Bangalore street food",
    "Filter coffee Bangalore",
    "Bisi Bele Bath",
    "Bangalore local cuisine",
    "Karnataka tourism",
    "visit Bangalore",
    "Bangalore IT hub",
    "tech city India",
    "Bangalore startups",
    "Bangalore shopping",
    "Commercial Street Bangalore",
    "Bangalore malls",
    "Bangalore heritage",
    "Tipu Sultan Palace",
    "Bull Temple Bangalore",
    "Bangalore temples",
    "weekend getaways Bangalore",
    "Bangalore to Mysore",
    "Bangalore to Coorg",
    "Bangalore Metro",
    "Bangalore airport",
    "best time visit Bangalore",
    "Bangalore hotels",
    "where to stay Bangalore",
    "Bangalore budget travel",
    "Bangalore luxury hotels",
    "Bangalore food scene",
    "best restaurants Bangalore",
    "Bangalore fine dining",
    "Bangalore street markets",
    "KR Market Bangalore",
    "Bangalore flower market",
    "Bangalore silk sarees",
    "Bangalore technology tourism",
    "Bangalore corporate travel",
    "Bangalore weekend activities",
    "hidden gems Bangalore",
    "offbeat places Bangalore",
    "Bangalore photography spots",
    "Bangalore at night",
    "Bangalore day trips",
    "Bangalore adventure activities",
    "trekking near Bangalore",
    "Bangalore lakes",
    "Ulsoor Lake",
    "Bangalore art galleries",
    "Bangalore cultural events",
    "Bangalore music scene",
    "Bangalore theater",
    "Bangalore family attractions",
    "Bangalore with kids",
    "Bangalore romantic places",
    "Bangalore couples destinations",
    "solo travel Bangalore",
    "Bangalore backpacking",
    "Bangalore hostel stay",
    "Bangalore airport to city",
    "Bangalore local transport",
    "Bangalore auto rickshaw",
    "Bangalore travel tips",
    "Bangalore safety tips",
    "Bangalore monsoon",
    "Bangalore festivals",
    "Bangalore New Year",
    "Bangalore events",
    "Bangalore conferences",
    "Bangalore trade shows",
    "Bangalore business travel",
    "Bangalore coworking spaces",
    "digital nomad Bangalore"
  ],
  "image": "https://images.unsplash.com/photo-1596176530529-78163a4f7af2?w=800",
  "shortDescription": "India's tech capital with amazing weather, great food, and enough parks to actually call it the Garden City.",
  "attractions": 38,
  "description": "Everyone still calls it Bangalore, even though it officially became Bengaluru back in 2014. This is where India's tech dreams live—Google offices next to 16th-century temples, startup founders grabbing masala dosas at 6 AM before their investor meetings, and software engineers from every corner of India making this city home.\n\nWhat makes Bangalore special isn't just the tech boom. It's the weather. While Delhi bakes at 45°C and Mumbai drowns in monsoon, Bangalore sits at a pleasant 20-30°C most of the year. That's why retirees used to love it here, and why tech companies still do.\n\nThe city's transformation since the 1980s has been wild. When Infosys and Wipro first set up shop, Bangalore was known more for its gardens than its gigabytes. Now Electronic City, Whitefield, and the Outer Ring Road are basically one giant tech campus. Microsoft, Amazon, Google—they're all here. The city churns out unicorn startups and exports more software than most countries.\n\nBut here's the thing—old Bangalore hasn't disappeared. Lalbagh Garden, planted way back in 1760, is still where people go to escape the city madness. The Glass House there hosts flower shows that pack in crowds. Cubbon Park's 300 acres remain a green lung in the middle of all the concrete. Morning joggers, elderly uncles reading newspapers, couples sitting on benches—it's all still there.\n\nThe food scene is incredible. You've got legacy places like Vidyarthi Bhavan serving the same legendary masala dosa since 1943. MTR opens before sunrise and the queue is already 20 people deep. Then there's Koshy's, this old-school cafe where writers and artists have been hanging out for decades. But Bangalore's also got Korean BBQ joints, craft breweries (more than any other Indian city), and farm-to-table restaurants that wouldn't be out of place in Portland.\n\nShopping means different things in different parts of town. Commercial Street is organized chaos—you haggle for everything from sarees to electronics. Brigade Road has the branded stores with fixed prices. Then you've got KR Market, where flower sellers and vegetable vendors have been doing business the same way for generations.\n\nEach neighborhood has its own vibe. Koramangala and Indiranagar are where the young crowd hangs out—cafes, startups, bars everywhere. Jayanagar is more traditional, with numbered blocks and proper South Indian restaurants. Whitefield is basically expat central with all the tech parks. Malleswaram still feels like old Bangalore with its traditional homes and filter coffee culture.\n\nThe city's biggest strength? It pulls in people from everywhere. You'll hear Hindi, Tamil, Telugu, Malayalam, and English all on the same street. This mix shows up best in the food—traditional Karnataka cuisine alongside every regional Indian food you can think of, plus international options.\n\nCulture-wise, there's a lot happening. The National Gallery has good contemporary art. Theater is big here—Ranga Shankara and Jagriti put on shows regularly. The Literature Festival draws big names every year. IISc (India Institute of Science) and the engineering colleges mean there's always something interesting going on academically.\n\nYou can still see pre-tech Bangalore if you look. Tipu Sultan's Summer Palace, built entirely from teak, is squeezed into the old city. Bangalore Palace looks like it was airlifted from England but has this distinctly Indian character. The Bull Temple in Basavanagudi has a massive Nandi carved from one piece of granite.\n\nNow for the reality check—traffic is absolutely brutal. A commute that should take 30 minutes can easily stretch to 2 hours. The metro is expanding but not fast enough. Water scarcity is a real problem. Lakes are polluted (though some are being cleaned up). Real estate prices have shot through the roof.\n\nDespite all this, people keep coming. Startups keep launching. The cafes still buzz with the next big idea. That's Bangalore—messy, energetic, and always optimistic. It's where someone drinking filter coffee at a 100-year-old restaurant is probably also coding the next big app. The future of India is literally being built here, one startup at a time.",
  "bestTimeToVisit": "Here's the good news—Bangalore's weather is pretty great year-round compared to most Indian cities. Sitting at 900 meters up on the Deccan Plateau means it never gets ridiculously hot or crazy cold. You can visit anytime and you'll be fine. But let's break down what each season actually feels like.\n\n**Winter (November to February): The Sweet Spot**\n\nIf you're picking just one time to visit, this is it. November through February is when Bangalore is at its best. Daytime temps sit around 20-28°C, and nights can drop to 12-15°C. Locals will be in sweaters and jackets complaining about the 'cold,' while you're probably thinking this is perfect t-shirt weather.\n\nMornings are crisp—great for hitting Lalbagh or Cubbon Park early. The weather is perfect for cafe hopping, brewery crawls, and actually walking around neighborhoods without sweating. Evenings are cool enough that outdoor dining is genuinely comfortable.\n\nYou'll also catch some good events. The Literature Festival usually happens in December. New Year's Eve is huge here—book your restaurant or pub spot way in advance. Theater season is in full swing.\n\nDownsides? This is peak season, so popular spots get more crowded and hotel prices inch up slightly (though nowhere near the spike you see in Goa or Rajasthan). Sometimes morning fog delays flights. And if you're used to tropical heat, pack a light jacket for the evenings.\n\n**Summer (March to May): Hot but Totally Manageable**\n\nWhile the rest of India is melting (Delhi hits 45°C, Mumbai becomes a steam bath), Bangalore maxes out at 32-35°C. That's warm, sure, but compared to everywhere else, it feels like relief. Evenings still cool down nicely.\n\nThis is actually a great time if you want to avoid crowds. School's in session until mid-April, so family tourism is low. Hotel prices stay reasonable. Plus, if you're escaping from northern India's brutal summer, Bangalore genuinely feels like a cool retreat.\n\nMango season hits in summer—Karnataka's mangoes flood the markets. Alphonso, Banganapalle, Totapuri—they're all amazing. Sugarcane juice sellers are everywhere. The famous filter coffee gets replaced by cold coffee variants.\n\nThe main issue is occasional water shortages. Bangalore depends on water pumped from far away, and summer strains the system. Some areas face restrictions. As a tourist, you'll rarely notice beyond maybe a hotel advisory, but it's something to know.\n\nPre-monsoon thunderstorms roll in during late afternoons—dramatic, sudden downpours that cool things off briefly and absolutely wreck the traffic for an hour or two.\n\n**Monsoon (June to October): Green and Gorgeous**\n\nMonsoon turns Bangalore into its greenest version. It starts in early June and goes through September, with October getting some tail-end showers. Unlike Mumbai's intense deluge, Bangalore's monsoon is moderate—steady but not overwhelming. Rain usually hits in late afternoons and evenings, not all day.\n\nTemps hover in a comfortable 22-28°C range. The rain washes away summer dust, cleans the air, and makes all the parks and gardens bloom like crazy. Lalbagh turns seriously green. The hills around Bangalore transform into lush forests.\n\nThere's something romantic about monsoon in Bangalore. That smell when rain hits dry earth—it's addictive. Street vendors sell hot pakoras and chai perfect for rainy evenings. Cafes set up cozy corners with window seats for rain watching. Breweries get packed with people gathering indoors.\n\nBut yeah, rain means challenges. Heavy downpours cause serious traffic jams. Low-lying areas flood. Potholes appear everywhere. Lakes overflow sometimes. Your outdoor plans need to be flexible—that morning at Nandi Hills might get cancelled.\n\nFor photographers and nature lovers though, monsoon is ideal. Nandi Hills gets wrapped in mist. Waterfalls near Coorg are at their best. The Western Ghats look incredible.\n\n**Festival Times**\n\nWhenever you come, timing it with festivals adds something special. Ugadi (Kannada New Year) falls in March/April with traditional celebrations. Ganesh Chaturthi in August/September sees big processions, especially in Basavanagudi. Dasara in October is spectacular, particularly in nearby Mysore. Diwali lights up the whole city. Christmas in December is beautiful with the Christian community decorating churches and homes.\n\n**What Should You Pick?**\n\nHonestly, Bangalore doesn't really have a bad season. Pick based on what else matters to you—festival timing, your work schedule, hotel deals, or when your friends can join.\n\nHere's my quick guide:\n- **First-timers wanting optimal everything**: November to February. Best weather, lots of cultural stuff happening.\n- **Budget travelers**: March to May. Slightly better deals, weather is still fine by Indian standards.\n- **Nature and photography people**: June to September. Everything's green, waterfalls are flowing.\n- **Festival lovers**: Time it around what you want to see—Dasara in October, Lit Fest in December, Ugadi in March/April.\n- **Outdoor activity fans**: October to March. Best for trekking, biking, exploring hills.\n- **Escaping hellish weather elsewhere**: Anytime. If you're fleeing Delhi's summer or Mumbai's floods, Bangalore feels like paradise.\n\nThe flexibility is rare for Indian cities. Unlike Goa (only good Nov-Feb) or hill stations (avoid monsoon), Bangalore works year-round. Pick based on what you want to do, not just the weather.",
  "bestTimeToVisitShort": "Year-round (pleasant climate, 20-30°C)",
  "topAttractions": [
    {
      "name": "Lalbagh Botanical Garden",
      "description": "This 240-acre garden right in the city has been around since 1760 when Hyder Ali planted it. The centerpiece is the Glass House—inspired by London's Crystal Palace—where flower shows happen twice a year in January and August. They're actually pretty spectacular.\n\nWhat's cool is walking past rock formations that are literally 3,000 million years old. The garden has over 1,800 plant species, including some seriously old trees that have seen the whole city transform. Early mornings, you'll find joggers, botanists studying plants, and families having picnics under massive rain trees. Birdwatchers show up at dawn with their fancy cameras. It's one of those places where the city chaos just fades away.",
      "image": "https://images.unsplash.com/photo-1585320806297-9794b3e4eeae?w=800",
      "timings": "6:00 AM - 7:00 PM",
      "entryFee": "₹25 for adults, ₹10 for children"
    },
    {
      "name": "Bangalore Palace",
      "description": "Built in 1878 by the Wadiyar royal family, this palace was inspired by Windsor Castle in England but has its own character. The Tudor-style architecture with fortified towers looks straight out of a storybook.\n\nInside, it's pretty opulent—hand-carved wooden ceilings, ornate furniture that screams royal taste, and the Durbar Hall with stained glass windows that create amazing light patterns. The audio tour takes you through private chambers where you can see the maharaja's old photographs.\n\nThe palace grounds (454 acres!) now host concerts and cultural festivals. International rock bands perform here against this royal backdrop, which is surreal. Entry costs ₹250 for Indians, ₹500 for foreigners.",
      "image": "https://images.unsplash.com/photo-1596176530529-78163a4f7af2?w=800",
      "timings": "10:00 AM - 5:30 PM",
      "entryFee": "₹250 for Indians, ₹500 for foreigners"
    },
    {
      "name": "Cubbon Park",
      "description": "300 acres of green space right in the middle of the city. Established in 1870, this isn't just a park—it's where Bangalore comes to breathe. Over 6,000 trees from 96 different species create this dense canopy that blocks out city noise.\n\nSunday mornings are special when roads close to traffic and thousands of people show up for cycling, skating, and yoga. The park has the State Library, High Court, and a few museums tucked inside. There's a bamboo grove that feels almost zen-like where people practice tai chi.\n\nKids chase butterflies, grandparents feed very tame squirrels, and artists set up easels to paint. It's completely free and open from 6 AM to 6 PM. One of the best ways to experience local Bangalore life.",
      "image": "https://images.unsplash.com/photo-1615729947596-a598e5de0ab3?w=800",
      "timings": "6:00 AM - 6:00 PM",
      "entryFee": "Free"
    },
    {
      "name": "ISKCON Temple",
      "description": "This massive temple in Rajajinagar opened in 1997 and has become one of Bangalore's most visited spots. It mixes traditional Dravidian style with contemporary architecture in a way that somehow works.\n\nBeyond the prayer halls, there's a multimedia theater, a library, and restaurants serving really good vegetarian food. The evening aarti (prayer ceremony) is worth experiencing—the chanting, synchronized movements, and flame offerings create this incredibly peaceful atmosphere regardless of your religious background.\n\nThe 56-foot gold-plated flagpost is visible from far away. On weekends, they host classical music and dance performances. The temple also runs Akshaya Patra, one of the world's largest kitchens, feeding thousands of school kids daily. Free entry, open from early morning (4:15 AM) till late evening (8:30 PM) with a break in the afternoon.",
      "image": "https://images.unsplash.com/photo-1582510003544-4d00b7f74220?w=800",
      "timings": "4:15 AM - 5:00 AM, 7:15 AM - 1:00 PM, 4:00 PM - 8:30 PM",
      "entryFee": "Free"
    },
    {
      "name": "Vidhana Soudha",
      "description": "This is Karnataka's legislative building, built in 1956 right after independence. It's massive—700 feet long, 150 feet tall—and represents this Neo-Dravidian architectural style that pulls from different Indian traditions. You'll spot Rajasthani balconies, South Indian temple carvings, and Indo-Saracenic arches all mixed together.\n\nYou can't go inside (it's a working government building), but the exterior is impressive. On Sunday evenings and public holidays, they light it up and it turns into this golden beacon. Great for photos. There's an inscription that says 'Government's Work is God's Work' which is... optimistic. Free to view from outside.",
      "image": "https://images.unsplash.com/photo-1612854124649-4f5f12b4f702?w=800",
      "timings": "Exterior viewing only (illuminated on Sundays and holidays 6:30 PM - 8:30 PM)",
      "entryFee": "Free (exterior viewing)"
    },
    {
      "name": "Nandi Hills",
      "description": "About 60 km from Bangalore, Nandi Hills sits at 4,851 feet and is where everyone goes to watch sunrise. The drive up the winding roads is fun, with hairpin turns revealing better and better views.\n\nAt the top, watching the sun come up while you're literally above the clouds is pretty magical. Yeah, you have to wake up at 3 AM, but it's worth it. There's history here too—Tipu Sultan had a summer retreat up here, and there's this cliff called Tipu's Drop where prisoners were supposedly pushed off (it's a 600-foot drop, so... yikes).\n\nThe ancient Nandi Temple dates back to the Chola period. You can also do paragliding and cycling if you're into that. Weather is pleasant year-round, but winter mornings get misty which makes for incredible photos. Entry is ₹35 per person, ₹175 for cars.",
      "image": "https://images.unsplash.com/photo-1580894742597-87bc8789db3d?w=800",
      "timings": "6:00 AM - 6:00 PM",
      "entryFee": "₹35 per person, ₹175 for cars"
    },
    {
      "name": "Tipu Sultan's Summer Palace",
      "description": "Hidden in the busy old city lanes, this palace is completely made of teakwood and dates back to 1791. The Indo-Islamic architecture is beautiful—ornate pillars, detailed floral carvings, and the colors have somehow stayed vibrant for centuries.\n\nThe museum has Tipu's personal stuff—clothes, crown, weapons. But honestly, it's the vibe that gets you. Standing in the Darbar Hall where major historical decisions were made is pretty cool. The gardens are smaller now but still peaceful. Entry is cheap—₹20 for Indians, ₹200 for foreigners.",
      "image": "https://images.unsplash.com/photo-1599831013130-62c2e7a6c6e9?w=800",
      "timings": "8:30 AM - 5:30 PM",
      "entryFee": "₹20 for Indians, ₹200 for foreigners"
    },
    {
      "name": "Bull Temple (Dodda Basavana Gudi)",
      "description": "In Basavanagudi, this temple has one of the world's largest Nandi (bull) statues—15 feet tall, 20 feet long, carved from a single piece of granite back in 1537. Devotees have been rubbing butter and sesame oil on it for so long it's polished to a shine.\n\nLocal legend says a bull was destroying groundnut crops until this temple was built, after which everything prospered. The temple has classic Dravidian architecture. Every year during the groundnut fair (Kadalekayi Parishe), the whole area becomes this huge market with farmers bringing their harvest.\n\nThe temple elephant blesses visitors, elderly folks gather in the courtyard for evening chats, and kids play traditional games. Nearby Bugle Rock Garden has good city views. Free entry.",
      "image": "https://images.unsplash.com/photo-1623849830166-d1e5b5f1228f?w=800",
      "timings": "6:00 AM - 12:00 PM, 5:00 PM - 9:00 PM",
      "entryFee": "Free"
    },
    {
      "name": "Ulsoor Lake",
      "description": "This 125-acre lake from the 1530s is right in the middle of the city. Early mornings, you'll see rowing enthusiasts gliding across the water, which looks amazing at sunrise. The walking path around the lake is where locals have formed these informal clubs—people share health tips, stock market advice, whatever.\n\nLots of birds hang out here—herons, cormorants, kingfishers. During Ganesh Chaturthi, thousands come for the immersion ceremony. You can rent pedal boats or motorboats (₹30-150). There's a kids' play area and outdoor gym equipment. Sometimes they host food festivals and cultural events. Free entry, open 6 AM to 8 PM.",
      "image": "https://images.unsplash.com/photo-1609920658906-8223bd289001?w=800",
      "timings": "6:00 AM - 8:00 PM",
      "entryFee": "Free (Boating charges: ₹30-150 per person)"
    },
    {
      "name": "Commercial Street",
      "description": "This kilometer-long shopping strip has been Bangalore's retail heart since the British era. Over 800 shops sell everything—traditional Kanchipuram sarees, trendy Western wear, handmade jewelry, cheap electronics, you name it.\n\nThe street wakes up early with flower vendors, then textile merchants unfold their fabrics. By noon it's organized chaos—shoppers bargaining hard, delivery boys on bikes weaving through crowds, street food smells mixing with incense. Old stores like Bombay Dyeing still have wooden cabinets and handwritten bills, while modern boutiques show off latest fashion.\n\nBargain hard—start at 50% of the quoted price. The street food is legendary—corner dosas, fresh juice, Bengali sweets with long queues. Open 10 AM to 8:30 PM, closed Sundays.",
      "image": "https://images.unsplash.com/photo-1555529669-e69e7aa0ba9a?w=800",
      "timings": "10:00 AM - 8:30 PM (Closed on Sundays)",
      "entryFee": "Free"
    }
  ],
  "localFood": [
    {
      "name": "Masala Dosa",
      "description": "The king of South Indian breakfast. This golden crispy crepe made from fermented rice and lentil batter comes stuffed with spiced potatoes, served with coconut chutney and sambar. Vidyarthi Bhavan in Gandhi Bazaar has been perfecting theirs since 1943—locals swear by it.",
      "whereToTry": "Vidyarthi Bhavan, MTR (Mavalli Tiffin Rooms), Brahmin's Coffee Bar",
      "price": "₹40-80"
    },
    {
      "name": "Bisi Bele Bath",
      "description": "Translates to 'hot lentil rice'—think of it as Karnataka's spiced-up version of khichdi. Rice, lentils, vegetables, and a special spice mix with cinnamon, cloves, and nutmeg, topped with ghee and cashews. MTR's version is so famous they sell ready-to-make packets for homesick Bangaloreans worldwide.",
      "whereToTry": "MTR, Puliyogare Point, Hotel Janatha",
      "price": "₹50-100"
    },
    {
      "name": "Filter Coffee",
      "description": "No Bangalore morning is complete without this. Dark roasted coffee with chicory, brewed in a traditional metal filter, mixed with hot frothy milk. It's served in a steel tumbler and dabarah (bowl). The ritual of pouring it between vessels to cool it down and create froth is part of the experience.",
      "whereToTry": "Indian Coffee House, Brahmin's Coffee Bar, Airlines Hotel",
      "price": "₹20-40"
    },
    {
      "name": "Idli Vada",
      "description": "Soft steamed rice cakes paired with crispy lentil donuts. The idlis are cloud-like, the vadas give you that satisfying crunch. Served with coconut, tomato, and mint chutneys plus sambar. Perfectly balanced, light but filling.",
      "whereToTry": "Brahmin's Coffee Bar, Veena Stores, CTR (Central Tiffin Room)",
      "price": "₹30-60"
    },
    {
      "name": "Ragi Mudde",
      "description": "Traditional Karnataka dish made from finger millet flour, formed into softball-sized balls. Eat it with sambar, chicken curry, or mutton curry. It's an acquired taste for outsiders, but locals love it for the health benefits. Pro tip: break off pieces and swallow without chewing—that's the traditional way.",
      "whereToTry": "Ragi Mane, Village Restaurant, Kamat Hotel",
      "price": "₹60-120"
    },
    {
      "name": "Mangalore Buns",
      "description": "Despite the name, these are sweet fluffy fried bread made with mashed bananas and a touch of cumin. Crispy outside, soft inside. Great with coconut chutney or sambar. Originally from coastal Karnataka but a Bangalore breakfast favorite now.",
      "whereToTry": "Central Tiffin Room, Udupi restaurants, SLV Corner",
      "price": "₹35-60"
    },
    {
      "name": "Akki Roti",
      "description": "Rice flour flatbread mixed with veggies like onions, carrots, coriander, and green chilies, then roasted on a griddle. Every place makes it differently—some add dill, others coconut. Usually eaten with chutney, pickle, or butter.",
      "whereToTry": "Kamat Hotels, Village Restaurant, Local darshinis",
      "price": "₹40-70"
    },
    {
      "name": "Obbattu/Holige",
      "description": "Sweet flatbread stuffed with jaggery and lentils or coconut, wrapped in soft wheat dough. Served hot with ghee and milk. It's a festival dish that brings back childhood memories for every Bangalorean. Families compete over whose recipe is best.",
      "whereToTry": "MTR, Brahmin's Bakery, Sweet shops in Malleswaram",
      "price": "₹30-50 per piece"
    },
    {
      "name": "Congress Kadlekai",
      "description": "Spicy roasted peanuts named after being served at Congress meetings back in the day. Coated with gram flour, red chili, and garlic—seriously addictive. You'll find vendors everywhere—bus stands, parks, markets—selling these in paper cones.",
      "whereToTry": "Street vendors, Lalbagh, Cubbon Park, Local markets",
      "price": "₹10-30"
    },
    {
      "name": "Thatte Idli",
      "description": "Named after the plate (thatte) they're served on. These are flatter, larger versions of regular idlis from Bidadi (between Bangalore and Mysore). Soft, spongy, slightly tangy. Perfect for soaking up chutney and sambar. People make special trips to Bidadi just for these.",
      "whereToTry": "Bidadi Thatte Idli Hotel, Vasudev Adiga's, IDC Kitchen",
      "price": "₹25-40"
    },
    {
      "name": "Vada Pav",
      "description": "Mumbai's street food that Bangalore adopted wholeheartedly. Deep-fried potato dumpling in a bun with chutneys. The IT crowd made it their unofficial snack—available at every corner now.",
      "whereToTry": "Anand Sweets, Street stalls near tech parks, Garden Vada Pav",
      "price": "₹20-40"
    },
    {
      "name": "Chow Chow Bath",
      "description": "This combination plate has one sweet dish (kesari bath) and one savory (upma) served together. The contrast—sweet semolina pudding with saffron next to savory semolina with vegetables—surprisingly works. A breakfast that covers all your taste preferences.",
      "whereToTry": "CTR, Janatha Hotel, Vidyarthi Bhavan",
      "price": "₹50-80"
    }
  ],
  "travelTips": [
    {
      "category": "Transportation",
      "tips": [
        "Download Namma Metro app for routes and recharging your metro card. The metro connects major spots like MG Road, Indiranagar, and the airport. Runs 5 AM to 11 PM.",
        "Use Uber, Ola, or Rapido during rush hour (8-10 AM, 5-8 PM) when auto drivers often refuse rides or jack up prices.",
        "Autos should use meters (₹30 minimum) but most don't. Try the 'Namma Yatri' app for fair pricing or negotiate before you start.",
        "BMTC buses are cheapest but crowded. Look for Volvo AC buses—slightly pricier but way more comfortable.",
        "Airport is 35km out. Use the prepaid airport taxi (₹800-1000) or Vayu Vajra bus (₹250) instead of regular cabs that might overcharge.",
        "Rent bikes through Bounce, Vogo, or Yulu for short distances—beats traffic and costs just ₹3-5 per km.",
        "Book outstation cabs a day ahead for places like Nandi Hills or Mysore. Shared cabs leave from Kalyan Nagar on weekends."
      ]
    },
    {
      "category": "Best Times & Weather",
      "tips": [
        "October to February is peak comfort (15-28°C)—pack light woolens for evenings and early mornings.",
        "Avoid long weekends when half the city drives to Coorg, Ooty, or Goa. Prices triple and traffic is a nightmare.",
        "Monsoon (June-September) brings surprise heavy showers. Always carry an umbrella—streets flood fast.",
        "April-May gets hot (35°C) but that's when you get the best hotel deals and fewer crowds.",
        "Visit parks and lakes early morning (6-8 AM) when weather's nice and you'll see locals doing their fitness thing.",
        "Save indoor stuff (malls, museums) for hot afternoons."
      ]
    },
    {
      "category": "Food & Dining",
      "tips": [
        "Darshinis are stand-and-eat joints with quick, cheap, authentic South Indian food. Order at counter, pay, get a token.",
        "Hit the iconic breakfast places before 11 AM—they switch to lunch menus and the famous stuff runs out.",
        "Bangalore's microbrewery scene is massive. Toit, Arbor Brewing, Windmills have great craft beers and food.",
        "Street food is usually safe but stick to busy stalls with high turnover. Skip cut fruits and ice unless it's from reputed places.",
        "Swiggy and Zomato deliver everything from 5-star restaurants to local favorites till late night.",
        "Many restaurants close 3-6 PM. Plan lunch before 3 PM or dinner after 7 PM.",
        "Green dots mean pure veg, red dots mean non-veg restaurants."
      ]
    },
    {
      "category": "Areas to Stay",
      "tips": [
        "Indiranagar/Koramangala - great for nightlife, cafes, restaurants but pricey and traffic-heavy.",
        "MG Road/Brigade Road - central location, metro access, near shopping but noisy.",
        "Malleshwaram/Basavanagudi - traditional areas with authentic food, peaceful but far from IT hubs.",
        "Whitefield/Electronic City - near tech parks, modern but far from city attractions (2-3 hours in traffic).",
        "Jayanagar - balanced option with good food, shopping, connectivity at reasonable prices.",
        "Book near metro stations to save time and money on commutes."
      ]
    },
    {
      "category": "Shopping & Bargaining",
      "tips": [
        "Commercial Street and Chickpet - bargain hard, start at 50% of asking price for clothes and accessories.",
        "Brigade Road and UB City Mall have fixed prices—no bargaining but wait for sale seasons.",
        "KR Market for flowers, spices, vegetables. Visit early (4 AM) to see the wholesale flower market in action.",
        "Cauvery Emporium (government-run) has authentic Karnataka silk sarees and handicrafts at fair fixed prices.",
        "Sunday Soul Sante flea market for quirky handmade stuff and organic food.",
        "Most shops close by 8:30 PM except malls (till 10 PM)."
      ]
    },
    {
      "category": "Cultural Etiquette",
      "tips": [
        "Bangalore's cosmopolitan but dress modestly at temples—cover shoulders and legs.",
        "Remove shoes before entering temples, some shops, and all homes.",
        "Learn basics: 'Namaskara' (hello), 'Dhanyavada' (thank you)—locals appreciate it.",
        "Tipping isn't required but nice—₹20-50 at local places, 10% at fancy restaurants.",
        "Public displays of affection are frowned upon, especially in traditional areas.",
        "Many locals speak fluent English with a distinct accent—be patient if you don't catch it first time."
      ]
    },
    {
      "category": "Safety & Health",
      "tips": [
        "Generally safe but avoid isolated areas after 10 PM. Stick to well-lit, busy streets.",
        "Keep document copies in cloud storage. Police are helpful but procedures take time.",
        "Drink only bottled water (Bisleri, Kinley) or find RO water stations.",
        "Air quality can be poor in traffic areas—carry a mask if you have respiratory issues.",
        "Emergency numbers: Police (100), Ambulance (108), Tourist Helpline (1363).",
        "Watch out for tourist scams at attractions. Official guides have ID cards—avoid random touts with 'special deals'.",
        "ATMs everywhere but tell your bank you're traveling to avoid card blocks."
      ]
    },
    {
      "category": "Weekend Getaways",
      "tips": [
        "Nandi Hills (60km) - leave by 4 AM for sunrise. Entry closes if parking fills up.",
        "Mysore (150km) - perfect day trip. Visit palace, zoo, Brindavan Gardens. Take the Shatabdi train for comfort.",
        "Coorg (270km) - needs 2-3 days. Book homestays in coffee estates for the full experience.",
        "Hampi (340km) - UNESCO site needs minimum 2 days. Take overnight bus or train.",
        "Pondicherry (310km) - French quarter and beaches. Popular long weekend spot—book months ahead.",
        "Skandagiri (70km) - night trek for sunrise. Needs forest department permission.",
        "Weekday trips are way less crowded if you can swing it."
      ]
    },
    {
      "category": "Tech & Connectivity",
      "tips": [
        "Free WiFi at metro stations, malls, cafes—speeds vary but works for basic stuff.",
        "Get a local SIM (Airtel, Jio) at the airport—costs ₹500-1000 for tourist plans with good data.",
        "UPI payments (GPay, PhonePe) work everywhere from street vendors to five-stars.",
        "Download offline maps for navigation. Google Maps traffic updates are solid but data-heavy.",
        "Power cuts are rare in main areas but carry a power bank.",
        "Most places take cards but keep ₹2000-3000 cash for street food, autos, and small vendors."
      ]
    },
    {
      "category": "Special Experiences",
      "tips": [
        "Catch a cricket match at Chinnaswamy Stadium—even if cricket's not your thing, the atmosphere is electric.",
        "Take a heritage walk in Basavanagudi or Malleshwaram with Unhurried or Bangalore Walks—₹500-800 per person.",
        "Visit during Karaga festival (March/April) or Kadalekai Parishe (November) for real cultural experiences.",
        "Book microlight flying at Jakkur Airfield for aerial city views.",
        "Join Sunday cycling groups at Cubbon Park—bikes available for rent, all levels welcome.",
        "Check out Ranga Shankara theater for plays in multiple languages—tickets from ₹200.",
        "Hit Ragigudda temple at night for panoramic city views with temple lights."
      ]
    }
  ],
  "budgetEstimate": "₹2,000 - ₹4,500 per day (mid-range budget)",
  "hiddenGems": [
    "Chunchi Falls - 85 km away near Kanakapura, this waterfall on the Arkavathi River is dramatic during monsoon but accessible year-round. The 2-3 hour trek keeps crowds away. Combine it with Sangama (where two rivers meet) and Mekedatu gorge nearby.",
    "Nrityagram Dance Village - 30 km out in Hesaraghatta, this residential dance community is dedicated to Indian classical dance. Founded by Odissi dancer Protima Bedi, it's a gurukul-style setup with performances, workshops, and a glimpse into disciplined dance practice. The earthen architecture and rural setting contrast sharply with Bangalore's tech chaos.",
    "Bangalore Fort and Tipu Sultan's Summer Palace - Hidden in the chaos of Avenue Road and KR Market, these structures from 1761 survive precariously amid modern development. The teak palace with Indo-Islamic architecture has beautiful floral motifs. The fort's Delhi Gate and dungeons remain, though the British demolished much of it. It's a time capsule in commercial chaos.",
    "Dodda Alada Mara (Big Banyan Tree) - A 400-year-old banyan tree spreading over 3 acres in Kethohalli village, 28 km away. The aerial roots spread so much it looks like an entire forest. Lightning destroyed the main trunk but the tree thrives through supporting roots. Mystical, especially at golden hour.",
    "Hesaraghatta Lake and Grasslands - Former reservoir turned urban grasslands, 20 km northwest. Over 200 bird species recorded here—raptors, waterbirds, the works. The shallow waters and scrubland create a unique ecosystem. Best October to February.",
    "Basavanagudi Bull Temple area - While the temple itself is known, most skip the neighborhood. Check out Bugle Rock Park with geological formations, Dodda Ganesha Temple with its massive monolithic idol, and Gandhi Bazaar's vibrant market where locals shop.",
    "Aviation Museum - Varthur Hobli has the HAL Aerospace Museum with vintage aircraft, helicopters, flight simulators. See everything from Marut jets to war helicopters. The outdoor display includes Vidyut prototypes and MiG fighters. Comprehensive and rarely crowded—great for aviation fans and kids.",
    "Thippagondanahalli Reservoir - 40 km west, this 1933 reservoir dam is decommissioned but scenic. The surrounding hills and sparse development make it peaceful. Nearby villages show rural Karnataka unchanged by Bangalore's tech boom. Popular with motorcyclists and photographers."
  ],
  "faq": [
    {
      "question": "Where can couples go private in Bangalore?",
      "answer": "Bangalore's one of the most couple-friendly cities in India. Try the rooftop cafes in Indiranagar - places like The Humming Tree or Sunny's have cozy corners. Lalbagh's glass house area is pretty secluded. Book a day room at any Oyo or hotel in Koramangala/Whitefield - they don't ask questions, just need IDs. Ulsoor Lake area has quiet spots. Or just hit any cafe in HSR Layout or Jayanagar - people are minding their own business. Bangalore's chill culture means you won't face harassment like in other cities."
    },
    {
      "question": "Where is Chota Ladakh in Bangalore?",
      "answer": "There isn't an actual 'Chota Ladakh' in Bangalore. You might be thinking of the Ladakh-themed cafes or restaurants that pop up sometimes, or maybe confusing it with the Tibetan settlement area. Bangalore has some cafes with Himalayan themes, but no official Ladakh-like area. If you want mountain vibes, Nandi Hills is your closest bet!"
    },
    {
      "question": "Is it illegal to walk in Bangalore after 11pm?",
      "answer": "No, it's not illegal at all! Bangalore doesn't have curfews. You can walk around anytime - MG Road, Indiranagar, Koramangala are active till late. Many cafes and restaurants stay open past midnight. The IT crowd works late, so you'll see people out even at 1-2 AM. That said, use common sense - stick to well-lit main roads if you're alone late at night. Areas like Brigade Road, Church Street are safe even late. Bangalore's generally safer than most Indian cities for late-night walks."
    },
    {
      "question": "Where can I go for a 2 day trip near Bangalore?",
      "answer": "Tons of options! Coorg (250 km) for coffee estates and misty weather. Chikmagalur (240 km) for trekking and nature. Mysore (145 km) for palaces and history - perfect weekend distance. Wayanad (270 km) if you want Kerala vibes. Kabini (220 km) for wildlife resort experience. Hampi (350 km, bit far but worth it) for ruins and boulders. Pondicherry (310 km) for beach and French vibes. Yercaud (220 km) for hill station feels. All these work great for 2-day trips - leave Saturday morning, back Sunday evening."
    },
    {
      "question": "What are the special places in Bangalore?",
      "answer": "Lalbagh's glass house is iconic, especially during the flower shows. Bangalore Palace if you're into royal architecture. Vidhana Soudha lit up at night is beautiful. Cubbon Park for that green lung in the city. Bull Temple in Basavanagudi with the massive Nandi statue. The microbrewery scene - Toit, Arbor Brewing are unique to Bangalore. VV Puram Food Street for authentic South Indian food. Nandi Hills for sunrise. Commercial Street for shopping. Honestly, Bangalore's vibe itself is special - it's more about the cafe culture and weather than specific monuments."
    },
    {
      "question": "How can I spend 3 days in Bangalore?",
      "answer": "Day 1: Start with breakfast at MTR or Vidyarthi Bhavan, hit Lalbagh Gardens, Bull Temple, lunch at VV Puram Food Street, afternoon at Cubbon Park, evening microbrewery in Indiranagar. Day 2: Early start to Nandi Hills for sunrise (leave by 4:30 AM), back for lunch, Bangalore Palace, Commercial Street shopping, evening at UB City. Day 3: Whitefield area if you're into tech stuff, or Bannerghatta Zoo, or just cafe-hop in Koramangala trying different South Indian breakfast joints. Bangalore's more about chilling than rushing through monuments."
    },
    {
      "question": "Where can I go for a short trip near Bangalore?",
      "answer": "For same-day trips, Nandi Hills (60 km) is perfect - go for sunrise, back by noon. Savandurga (50 km) for a quick trek. Wonderla (30 km) if you want a water park day. Ramanagara (50 km) for rock climbing and the Sholay shooting location. Shivanasamudra Falls (130 km) - go during monsoon. Bheemeshwari (100 km) for river rafting. Anthargange (70 km) for night treks. Skandagiri (70 km) for sunrise trek. All these are under 2-3 hours, perfect for weekend morning trips if you don't want to stay overnight."
    },
    {
      "question": "How to spend a day in Bangalore?",
      "answer": "Start with filter coffee and masala dosa at Vidyarthi Bhavan (get there by 8 AM). Spend morning at Lalbagh - walk around, check out the glass house. Quick stop at Bull Temple. Lunch at a local Darshini or VV Puram Food Street for authentic stuff. Afternoon at Cubbon Park, maybe visit Vidhana Soudha from outside. Evening hit a microbrewery - Toit in Indiranagar or Arbor Brewing. Or just cafe-hop in Koramangala. That's a solid Bangalore day - gardens, food, and pub culture."
    },
    {
      "question": "What is Bangalore famous about?",
      "answer": "Weather, first of all - pleasant year-round compared to other metros. It's India's Silicon Valley, so tech and startups. The pub and microbrewery culture is huge here - you'll find craft beer spots everywhere. Garden City tag - Lalbagh, Cubbon Park. Amazing South Indian food, especially dosas and filter coffee. The cosmopolitan vibe - people from all over India. Traffic (unfortunately). Rock music scene. Also famous for startups, IT parks, and that work-life balance everyone talks about. Oh, and weekend trips to surrounding hill stations. Bangalore's basically where young India wants to live!"
    },
    {
      "question": "Where can I go for 2 days in Bangalore?",
      "answer": "Within Bangalore for 2 days? Day 1: Morning Lalbagh, Bull Temple, lunch at local South Indian spot, Cubbon Park and Vidhana Soudha afternoon, evening brewery crawl in Indiranagar (Toit, Arbor, Windmills). Day 2: Early Nandi Hills sunrise, back for breakfast at MTR, Bangalore Palace, Commercial Street or Brigade Road shopping, evening at Phoenix Mall or UB City. Try different cafes for coffee - Third Wave, Blue Tokai. Hit VV Puram or Gandhi Bazaar for street food. That covers the main stuff without feeling rushed."
    },
    {
      "question": "Where can I go at night in Bangalore?",
      "answer": "Bangalore's nightlife is solid. MG Road and Brigade Road are lit up and active. Pubs and microbreweries in Indiranagar - Toit, Byg Brewski stay open till 11 PM. Koramangala has tons of late-night cafes. Church Street for pubs. UB City for upscale lounges. Phoenix Marketcity or Orion Mall if you want shopping/movies. Late-night drives to Nandi Hills (if you're leaving at 3-4 AM for sunrise). VV Puram Food Street is good till 10 PM. Clubs at Indranagar, Koramangala, MG Road area. Just note most places close by 11 PM due to regulations, but there's plenty happening till then."
    },
    {
      "question": "Is Bangalore good for tourists?",
      "answer": "Honestly? Bangalore's better for living than touring. It's not loaded with monuments like Delhi or Jaipur. What it offers is great weather, amazing food scene, cafe culture, pub culture, and proximity to tons of weekend getaway spots. If you want typical tourist stuff, 2 days is enough for Bangalore itself. But if you appreciate good coffee, craft beer, South Indian food, and want a base to explore Karnataka (Coorg, Mysore, Hampi are all nearby), then yes, Bangalore's perfect. It's more of a vibe city than a sightseeing city. Come here to experience how young urban India lives, not to tick off monuments."
    }
  ]
}
