{
  "slug": "delhi",
  "name": "Delhi",
  "state": "National Capital Territory",
  "keywords": [
    "Delhi travel guide",
    "Delhi tourism",
    "things to do in Delhi",
    "Delhi attractions",
    "places to visit Delhi",
    "explore Delhi",
    "Delhi city guide",
    "Red Fort Delhi",
    "Red Fort UNESCO",
    "Lal Qila",
    "India Gate",
    "India Gate monument",
    "Qutub Minar",
    "Qutub Minar UNESCO",
    "Lotus Temple",
    "Baháʼí Temple Delhi",
    "Humayun's Tomb",
    "Humayun's Tomb UNESCO",
    "Old Delhi",
    "Purani Dilli",
    "New Delhi",
    "Lutyens Delhi",
    "Chandni Chowk",
    "Chandni Chowk market",
    "Chandni Chowk food",
    "Delhi Metro",
    "Delhi Metro map",
    "Delhi street food",
    "Butter Chicken Delhi",
    "Karim's Delhi",
    "Paranthe Wali Gali",
    "Chole Bhature Delhi",
    "Delhi chaat",
    "Golden Triangle India",
    "Delhi monuments",
    "Mughal architecture",
    "visit Delhi",
    "Delhi sightseeing",
    "Delhi NCR tourism",
    "national capital India",
    "Delhi heritage",
    "Delhi forts",
    "Jama Masjid Delhi",
    "Akshardham Temple",
    "Delhi temples",
    "Gurudwara Bangla Sahib",
    "Delhi religious sites",
    "Connaught Place",
    "CP Delhi",
    "Rajpath Delhi",
    "Parliament House Delhi",
    "Rashtrapati Bhavan",
    "Delhi government buildings",
    "Delhi museums",
    "National Museum Delhi",
    "Gandhi Smriti",
    "Nehru Memorial Museum",
    "Delhi art galleries",
    "National Gallery Modern Art",
    "Delhi shopping",
    "Sarojini Nagar Market",
    "Lajpat Nagar",
    "Dilli Haat",
    "Khan Market Delhi",
    "Select Citywalk",
    "Delhi malls",
    "Delhi bazaars",
    "Delhi handicrafts",
    "Delhi street markets",
    "Delhi nightlife",
    "Hauz Khas Village",
    "Delhi pubs",
    "Delhi clubs",
    "Delhi restaurants",
    "best food Delhi",
    "Delhi fine dining",
    "Delhi cafes",
    "Delhi coffee culture",
    "Delhi Mughlai food",
    "Delhi kebabs",
    "Delhi biryani",
    "Delhi sweets",
    "Delhi halwa",
    "Lodhi Garden",
    "Delhi parks",
    "Garden of Five Senses",
    "Delhi green spaces",
    "Delhi weather",
    "Delhi summer",
    "Delhi winter",
    "Delhi monsoon",
    "best time visit Delhi",
    "Delhi hotels",
    "where to stay Delhi",
    "Delhi luxury hotels",
    "Delhi budget hotels",
    "Delhi hostels",
    "backpacking Delhi",
    "Delhi heritage walks",
    "Delhi walking tours",
    "Delhi guided tours",
    "Delhi day trips",
    "Delhi to Agra",
    "Delhi to Jaipur",
    "Delhi weekend getaways",
    "Delhi airport",
    "Indira Gandhi Airport",
    "Delhi railway stations",
    "New Delhi Railway Station",
    "Delhi local transport",
    "Delhi bus",
    "Delhi auto rickshaw",
    "Delhi travel tips",
    "Delhi safety tips",
    "solo travel Delhi",
    "Delhi for couples",
    "Delhi romantic places",
    "Delhi family attractions",
    "Delhi with kids",
    "Delhi business travel",
    "Delhi corporate hotels",
    "Delhi conferences",
    "hidden gems Delhi",
    "offbeat Delhi",
    "secret spots Delhi",
    "unexplored Delhi",
    "Delhi photography",
    "Delhi at night",
    "Delhi street photography",
    "Delhi culture",
    "Delhi festivals",
    "Diwali Delhi",
    "Holi Delhi",
    "Delhi events",
    "Delhi trade shows",
    "Delhi pollution",
    "Delhi air quality"
  ],
  "image": "https://images.unsplash.com/photo-1587474260584-136574528ed5?w=800",
  "shortDescription": "India's capital where 5,000 years of history crashes into modern ambitions—chaotic, overwhelming, unforgettable.",
  "attractions": 52,
  "description": "Delhi isn't just India's capital—it's where 5,000 years of continuous civilization collide with the ambitions of a rising superpower. Over 20 million people call this place home, and the city wears many faces: the chaotic charm of Old Delhi's 17th-century lanes where bicycle rickshaws somehow navigate impossibly narrow passages, the imperial grandeur of British-built New Delhi with tree-lined boulevards and imposing government buildings, and the gleaming corporate towers where global tech giants reshape India's digital future.\n\nThe city's history is wild. Seven distinct cities rose and fell here over millennia, leaving behind an archaeological treasure trove. Delhi has three UNESCO World Heritage Sites. The Red Fort's massive sandstone walls echo with Mughal emperor proclamations. Humayun's Tomb sits in serene gardens offering respite from urban chaos. Qutub Minar's victory tower has watched over Delhi for 800 years, its iron pillar defying rust through metallurgical secrets we've lost.\n\nThe British left their mark too—Rashtrapati Bhavan presidential palace and India Gate war memorial showcase imperial ambitions frozen in red sandstone and marble.\n\nBut Delhi isn't a museum—it's vibrantly, sometimes overwhelmingly, alive. Old Delhi's Chandni Chowk remains one of Asia's largest and most chaotic bazaars. Wedding shops overflow with glittering lehengas, spice merchants sell saffron by the kilo, and street food vendors serve legendary paranthe. The aroma of kebabs from Karim's mingles with incense from nearby temples and diesel fumes from auto-rickshaws.\n\nHere, Hindu temples, Sikh gurdwaras, Jain temples, and grand mosques stand within walking distance, reflecting India's pluralistic soul.\n\nNew Delhi presents a different face—wider roads (though equally congested), diplomatic enclaves, and tree-shaded neighborhoods where joggers circle ancient tombs at dawn. Connaught Place's Georgian-era circular market remains the commercial heart. Khan Market draws the elite with artisanal cafes and boutique shops, while Hauz Khas Village mixes medieval ruins with hipster bars in an impossibly Delhi juxtaposition.\n\nThe Delhi Metro, opened in 2002, transformed urban mobility. Air-conditioned trains carry over 5 million passengers daily, whisking riders from Mughal monuments to tech hubs. Yet cycle rickshaws still ply Old Delhi's lanes, and auto-rickshaw drivers negotiate fares with the same vigor their grandfathers did.\n\nDelhi's food scene is legendary. Street food isn't just sustenance—it's religion. Paranthe wali gali serves fried bread stuffed with dozens of fillings. Bengali Market's chaat vendors create explosions of sweet, spicy, and tangy flavors. Karim's, operating since 1913, serves Mughlai cuisine in a hole-in-the-wall that's hosted presidents and paupers. Modern Delhi adds restaurants spanning every global cuisine.\n\nThe seasonal extremes shape life here. Summer temps touch 45°C, sending those who can afford it to hill stations. Monsoon brings relief but also flooding. Winter mornings see the city wrapped in fog, locals bundled against what they consider cold (10-15°C), street vendors selling roasted peanuts.\n\nThe brief spring and autumn offer perfect weather for exploring parks—Lodhi Gardens for morning walks among medieval tombs, or India Gate's sprawling lawns.\n\nDelhi is also India's political nerve center. Parliament sessions shape the nation. Protests at Jantar Mantar are as much a part of Delhi's character as its monuments. Media, policy think tanks, and NGO headquarters cluster here.\n\nBut this density creates challenges. Air pollution, especially in winter, reaches hazardous levels. Traffic tests patience daily. The gap between rich and poor is stark—luxury malls and slums coexist within walking distance.\n\nYet Delhi persists, adapts, evolves. Migrants from across India come seeking opportunity, adding their threads to the city's impossibly complex cultural tapestry. Love it or hate it, Delhi demands a response. It's never boring, never simple, and absolutely essential to understanding India.",
  "bestTimeToVisit": "Delhi's climate extremes make timing crucial. Most people agree October to March is ideal—but within this window, each season has its own character.\n\n**Winter (November to February): Peak Season**\n\nWinter is Delhi's tourism sweet spot. November through February sees daytime temps between 15-25°C, perfect for the extensive walking required to explore monuments and markets. The sun shines bright but not scorching, and evening chill adds pleasant contrast to warm restaurant meals and chai breaks.\n\nDecember and January are coldest, with mornings occasionally dipping to 5-7°C. Locals bundle up in jackets, considering this genuinely cold (though visitors from colder climates find it refreshingly mild). Morning fog is common in January, sometimes delaying flights but creating atmospheric views of monuments emerging from mist.\n\nThis is wedding season—if you're invited to an Indian wedding now, you're in for an unforgettable cultural experience. Winter brings major festivals too. The International Kite Festival in January sees colorful kites dotting the sky. Republic Day on January 26th features a grand military parade down Rajpath (tickets available but book early).\n\nDownside? Peak tourist season means crowds at popular monuments and hotel rates climb. Air quality becomes a serious concern November through January—a combination of crop burning, festival firecrackers, and weather traps pollutants, creating hazardous smog. Sensitive travelers should carry N95 masks and monitor Air Quality Index readings.\n\n**Shoulder Months (October and March): The Sweet Spots**\n\nOctober and March are arguably the best compromise. October post-monsoon sees Delhi washed clean, temps dropping from summer extremes to pleasant 20-30°C. Parks and gardens display their greenest foliage. Dussehra typically falls in October with elaborate celebrations. Diwali usually occurs in October or early November, transforming Delhi into a spectacular display of lights and fireworks.\n\nMarch marks spring's brief window before summer hits. Temps range 15-28°C—ideal for sightseeing. Holi typically falls in March, offering one of India's most photogenic celebrations (though be prepared to get drenched in colored water and powder). Brief flowering season sees gulmohar and jacaranda blooming across New Delhi's avenues.\n\nThese months offer significantly better hotel rates than peak winter while avoiding summer's brutality. Crowds are manageable, air quality is better. If you have flexibility, October and March provide the best overall value.\n\n**Monsoon (July to September): For the Adventurous**\n\nDelhi's monsoon isn't continuous downpour—it's sporadic heavy showers mixed with humid sunny periods. Temps drop to 25-35°C (still warm but more bearable). Rains wash away dust and pollution. Gardens bloom.\n\nHowever, heavy downpours can flood low-lying areas, causing traffic nightmares that turn 30-minute journeys into two-hour ordeals. Outdoor sites become muddy. Humidity is high. Mosquitoes proliferate.\n\nIf you're a photographer seeking dramatic storm clouds over monuments, or a budget traveler taking advantage of off-season rates, monsoon can work. Just pack a good umbrella, waterproof footwear, and patience.\n\n**Summer (April to June): The Challenging Period**\n\nUnless you have compelling reasons, avoid Delhi's summer. April starts warm at 30-35°C, but by May and June, temps routinely exceed 40°C, with spikes to 45°C or 48°C during heat waves. The 'loo'—hot, dry winds—blow across the northern plains, making afternoon hours genuinely dangerous. Heat exhaustion is a real risk.\n\nThe city adapts through midday retreat. Shops and offices often close for extended lunch breaks. Markets are quiet during midday, coming alive after 5 PM. If you must visit during summer, plan monument visits for early morning (6-9 AM) or late evening, stay hydrated, and rely on AC spaces for hottest hours.\n\nSummer offers one advantage: absolute off-season means rock-bottom hotel prices, empty monuments, and a different perspective on how residents navigate their city's most challenging season. Mango season is another silver lining—May and June bring dozens of mango varieties to markets at peak ripeness.\n\n**Making Your Choice**\n\nFirst-timers prioritizing comfort: November to February despite crowds and air quality.\nBest balance of weather, value, and fewer crowds: October or March.\nBudget travelers: Monsoon season with proper planning.\nSummer: Best avoided unless circumstances require it.\n\nRemember Delhi's pollution is year-round but worst in winter. Check Air Quality Index forecasts and plan indoor activities for bad days.",
  "bestTimeToVisitShort": "October to March (pleasant weather, 10-25°C)",
  "topAttractions": [
    {
      "name": "Red Fort (Lal Qila)",
      "description": "This massive red sandstone fort is Delhi's most powerful symbol of Mughal grandeur. Built in 1648, walking through its Lahori Gate feels like stepping into history where Emperor Shah Jahan once held court.\n\nThe architecture is stunning—the Diwan-i-Aam where the emperor met common subjects, and the Diwan-i-Khas with its famous inscription 'If there is paradise on earth, it is this.' Every evening, a spectacular sound and light show narrates Delhi's history.\n\nChandni Chowk bazaar right outside adds to the experience. On Independence Day, the Prime Minister hoists the flag here, continuing a tradition from 1947. Entry is ₹35 for Indians, ₹500 for foreigners. Closed Mondays.",
      "image": "https://images.unsplash.com/photo-1597074866923-dc0589150358?w=800",
      "timings": "9:30 AM - 4:30 PM (Closed on Mondays)",
      "entryFee": "₹35 for Indians, ₹500 for foreigners"
    },
    {
      "name": "India Gate",
      "description": "This 42-meter sandstone arch is Delhi's most recognizable landmark—a memorial to 82,000 Indian soldiers who fell during WWI. Designed by Edwin Lutyens, it's become the city's favorite gathering spot.\n\nThe eternal flame of Amar Jawan Jyoti burns beneath, honoring soldiers from the 1971 war. As evening approaches, families spread out on lawns with picnics, children chase bubbles, couples find privacy in the vast public space. Ice cream carts, balloon sellers, and instant photo photographers create nostalgic charm.\n\nDuring Republic Day, the area becomes the epicenter of national pride with military parades. The newly inaugurated National War Memorial nearby adds another dimension. Open 24 hours, best visited evening. Free entry.",
      "image": "https://images.unsplash.com/photo-1587474260584-136574528ed5?w=800",
      "timings": "24 hours (best visited evening)",
      "entryFee": "Free"
    },
    {
      "name": "Qutub Minar",
      "description": "At 73 meters, this is the world's tallest brick minaret and a testament to Indo-Islamic brilliance. Built in 1193 by Qutub-ud-din Aibak, this UNESCO site tells its story through intricate Arabic inscriptions carved into red sandstone and marble.\n\nThe tower tapers from a 15-meter base to just 2.5 meters at top—an architectural feat that's survived earthquakes and lightning for eight centuries. The rust-free Iron Pillar from the 4th century continues to baffle metallurgists.\n\nThe Quwwat-ul-Islam Mosque was built using pillars from destroyed Hindu and Jain temples, creating unique architectural fusion. The incomplete Alai Minar tells of Sultan Alauddin Khilji's ambition to build a tower twice as tall, abandoned after his death. Entry ₹40 for Indians, ₹600 for foreigners.",
      "image": "https://images.unsplash.com/photo-1588262713567-b9b01f2dc1c4?w=800",
      "timings": "7:00 AM - 5:00 PM",
      "entryFee": "₹40 for Indians, ₹600 for foreigners"
    },
    {
      "name": "Lotus Temple",
      "description": "Like a giant lotus flower blooming in concrete, this Baháʼí House of Worship is one of the world's most visited buildings. Completed in 1986, architect Fariborz Sahba's masterpiece uses 27 marble-clad petals arranged in clusters.\n\nThe temple welcomes everyone regardless of religion—inside, the prayer hall accommodates 1,300 people for silent prayer and meditation. No sermons, no rituals. The surrounding 26 acres of landscaped gardens with pools create a microclimate several degrees cooler than the city.\n\nDuring evenings, the marble glows ethereally, and reflections in pools create an illusion of the lotus floating on water. The temple attracts over 4 million visitors annually, surpassing even the Eiffel Tower in daily footfall. Free entry.",
      "image": "https://images.unsplash.com/photo-1605649487212-47bdab064df7?w=800",
      "timings": "9:00 AM - 5:30 PM (Oct-Mar), 9:00 AM - 7:00 PM (Apr-Sep), Closed on Mondays",
      "entryFee": "Free"
    },
    {
      "name": "Humayun's Tomb",
      "description": "This sublime garden tomb, built in 1565 by Empress Bega Begum, was the first garden-tomb on the Indian subcontinent and inspired the Taj Mahal. The UNESCO site showcases Mughal architecture at its finest with perfect symmetry, combining Persian traditions with Indian craftsmanship.\n\nThe double-domed structure rises from a 7-meter platform, its red sandstone contrasting with white marble details. The char bagh (four-part) garden represents Quranic paradise. The tomb houses not just Emperor Humayun but over 160 Mughal family members, earning it the nickname 'dormitory of the Mughals.'\n\nRecent restoration by Aga Khan Trust has revived water channels and gardens to original glory. The tomb gains special significance during sunset when sandstone glows amber. Entry ₹40 for Indians, ₹600 for foreigners.",
      "image": "https://images.unsplash.com/photo-1586339277861-b0b7d3b455d6?w=800",
      "timings": "Sunrise to Sunset",
      "entryFee": "₹40 for Indians, ₹600 for foreigners"
    },
    {
      "name": "Jama Masjid",
      "description": "India's largest mosque spreads its red sandstone and white marble magnificence across Old Delhi, its courtyard holding 25,000 devotees. Built by Shah Jahan between 1644-1656, it has three gateways, two 40-meter minarets, and four towers.\n\nClimbing the southern minaret (when open) rewards you with breathtaking 360-degree views of Old Delhi's chaotic beauty—a sea of buildings punctuated by temple spires, mosque domes, and the Red Fort in distance.\n\nThe mosque houses relics including an ancient Quran written on deerskin, Prophet Muhammad's red beard hair, his sandals, and footprints in marble. During Ramadan, the area transforms into a food paradise after sunset. The pigeon feeders outside create magical moments as hundreds of birds take flight. Entry free, ₹300 for camera.",
      "image": "https://images.unsplash.com/photo-1591017403321-dc264d1fd6e5?w=800",
      "timings": "7:00 AM - 12:00 PM, 1:30 PM - 6:30 PM",
      "entryFee": "Free (₹300 for camera, ₹100 for minaret climb)"
    },
    {
      "name": "Akshardham Temple",
      "description": "Rising from the Yamuna banks like a vision from ancient scriptures, Akshardham redefines modern Hindu architecture. Opened in 2005, this complex spreads across 100 acres, its central monument built from pink sandstone and Carrara marble without any steel or concrete.\n\nThe intricately carved temple features 20,000 statues, 234 ornate pillars, 9 domes, and 148 elephants. The musical fountain show after sunset narrates an ancient story through water, lights, and music. The temple's exhibitions use robotics and an IMAX-style theater to bring Hindu philosophy to life.\n\nThe Yagnapurush Kund, the world's largest stepwell, hosts the musical fountain. Despite being relatively new, it's become Delhi's most visited attraction after the Taj. Entry free, exhibitions ₹170 adults.",
      "image": "https://images.unsplash.com/photo-1594735760431-c12ad6eca331?w=800",
      "timings": "9:30 AM - 6:30 PM (Closed on Mondays)",
      "entryFee": "Free (Exhibitions: ₹170 adults, ₹100 children)"
    },
    {
      "name": "Lodhi Garden",
      "description": "This 90-acre park offers serenity where 15th-century tombs coexist with morning joggers, yoga enthusiasts, and young lovers. This archaeological park preserves Sayyid and Lodhi dynasty works scattered across manicured lawns.\n\nThe garden has evolved into Delhi's most democratic space where diplomats power-walk alongside locals, where expensive pedigree dogs socialize with street puppies. The butterfly conservatory attracts nature enthusiasts, while over 100 species of trees and birds make it a biodiversity hotspot.\n\nSunday mornings see laughter clubs, music groups, even Shakespeare readings. The National Bonsai Park adds a Japanese zen element. Free entry, open 5 AM to 8 PM.",
      "image": "https://images.unsplash.com/photo-1582407947304-fd86f028f716?w=800",
      "timings": "5:00 AM - 8:00 PM (Oct-Mar), 5:00 AM - 8:00 PM (Apr-Sep)",
      "entryFee": "Free"
    },
    {
      "name": "Chandni Chowk",
      "description": "This is sensory overload in the best way—a 17th-century market where centuries-old havelis hide treasures from Mughal jewelry to latest smartphones. Designed by Princess Jahanara in 1650, this 'moonlight square' is one of Asia's largest wholesale markets.\n\nNarrow galis (lanes) each have specialties—Kinari Bazaar for wedding accessories, Khari Baoli for Asia's largest spice market, Dariba Kalan for silver jewelry. Food here is legendary—from 150-year-old Paranthe Wali Gali to Karim's Mughlai cuisine.\n\nThe recently pedestrianized Chandni Chowk offers glimpses of former glory, though the real charm lies in getting lost in maze-like lanes where each turn reveals hidden temples, forgotten havelis, and culinary treasures. Open 9 AM to 8 PM, closed Sundays. Free entry.",
      "image": "https://images.unsplash.com/photo-1573138756850-d6c1981a0e62?w=800",
      "timings": "9:00 AM - 8:00 PM (Closed on Sundays)",
      "entryFee": "Free"
    },
    {
      "name": "Hauz Khas Village",
      "description": "This perfectly encapsulates Delhi's dual personality—a 14th-century urban village that's become the epicenter of creative and nightlife scene. Built around an ancient water reservoir by Alauddin Khilji, it combines Sultanate monuments with trendy cafes and art galleries.\n\nThe deer park offers morning walkers a chance to spot peacocks and rabbits, while medieval ruins provide Instagram backdrops. As sun sets, the village transforms—rooftop restaurants fill with young professionals, live music spills from bars, art galleries host exhibition openings.\n\nNarrow lanes hide everything from traditional pottery shops to contemporary designer studios, Lebanese restaurants to molecular gastronomy experiments. This juxtaposition of ancient and ultra-modern makes it Delhi's most fascinating neighborhood. Free for park and monuments.",
      "image": "https://images.unsplash.com/photo-1564769662533-4f00a87b4056?w=800",
      "timings": "Monuments: Sunrise to Sunset; Restaurants/Cafes: 11:00 AM - 1:00 AM",
      "entryFee": "Free for park and monuments"
    }
  ],
  "localFood": [
    {
      "name": "Chole Bhature",
      "description": "Delhi's ultimate comfort food—spicy chickpea curry with puffy deep-fried bread. The chole is slow-cooked overnight with tea leaves for that dark color, carrying complex flavors from a secret spice blend. Sita Ram Diwan Chand in Paharganj has served their legendary version since 1950, with queues starting before 8 AM opening. The accompaniments—tangy pickle, sliced onions, green chutney—cut through the richness.",
      "whereToTry": "Sita Ram Diwan Chand, Baba Nagpal Corner, Chache Di Hatti",
      "price": "₹60-150"
    },
    {
      "name": "Butter Chicken",
      "description": "Created accidentally at Moti Mahal in the 1950s when leftover chicken was mixed with tomato-butter-cream gravy. This became Delhi's gift to global cuisine. Chicken is marinated, grilled in tandoor until charred, then simmered in silky sauce balancing tangy tomatoes with rich butter and cream. The addition of kasoori methi adds distinctive aroma.",
      "whereToTry": "Moti Mahal Delux, Gulati, Aslam Chicken",
      "price": "₹350-800"
    },
    {
      "name": "Paranthe Wali Gali Parathas",
      "description": "This narrow Chandni Chowk lane has served stuffed parathas since the 1870s. Unlike typical parathas, these are deep-fried, creating crispy exteriors with innovative fillings—from traditional aloo to exotic papad, rabri, even banana. Pandit Gaya Prasad offers 30 varieties including famous kaju-kishmish. Watching parathas being rolled and fried in massive iron kadhais while sitting on rickety benches adds charm.",
      "whereToTry": "Pt. Gaya Prasad Shiv Charan, Pt. Dayal Paratha Wala, Kanhaiya Lal Durga Prasad",
      "price": "₹70-200 per plate"
    },
    {
      "name": "Daulat ki Chaat",
      "description": "This ethereal winter dessert appears only October to February. Made by churning milk overnight in winter cold until it forms light foam, garnished with khoya, pistachios, saffron. It literally melts on your tongue. The art is dying—it requires perfect winter temperature, skilled hands, waking at 3 AM to start churning. The few remaining vendors guard family techniques zealously.",
      "whereToTry": "Chandni Chowk, Old Delhi street vendors, Kinari Bazaar",
      "price": "₹30-60"
    },
    {
      "name": "Kebabs at Karim's",
      "description": "Established 1913 by Mohammed Aziz, a descendant of Mughal royal chefs, Karim's serves recipes that once graced Emperor's tables. Their seekh kebabs use finely minced mutton with 32 spices, grilled over charcoal. The mutton burra falls off the bone. The restaurant's location in a cramped Jama Masjid lane with no-frills ambiance adds authenticity. Their breakfast nahari allegedly cures hangovers.",
      "whereToTry": "Karim's (Jama Masjid), Al Jawahar, Qureshi Kebab Corner",
      "price": "₹200-500"
    },
    {
      "name": "Delhi Chaat",
      "description": "Delhi's chaat culture is a philosophy of balancing six tastes in every bite. Papdi chaat combines crispy wafers with potatoes, chickpeas, yogurt, chutneys, topped with sev. Aloo tikki are potato patties broken open and loaded with chutneys. Gol gappa experience involves standing at a cart, receiving hollow puris filled with spiced water, consuming in one bite before they dissolve.",
      "whereToTry": "Nathu's Sweets, Prince Chaat, Lala Babu Chaat Bhandar",
      "price": "₹50-150"
    },
    {
      "name": "Nihari",
      "description": "This slow-cooked stew originated in Old Delhi during Mughal era as laborer breakfast. Beef or mutton shanks cook overnight with bone marrow in sealed pot with dozens of spices. Result is meat so tender it falls apart and gravy thick with dissolved marrow. Served with khameeri roti and garnished with ginger, chilies, lemon. Kallu Nihari opens at dawn, serving construction workers and executives alike.",
      "whereToTry": "Kallu Nihari, Haji Shabrati Nihari Wale, Javed Famous Nihari",
      "price": "₹120-200"
    },
    {
      "name": "Kulfi Faluda",
      "description": "Delhi's answer to ice cream sundae—dense frozen milk (kulfi) with rose-flavored vermicelli (faluda), basil seeds, rose syrup. Unlike ice cream, kulfi is slow-cooked until milk reduces to a third, creating intensely milky texture. Kuremal stuffs kulfi inside actual fruits—mangoes, oranges, pomegranates—creating edible bowls.",
      "whereToTry": "Kuremal Mohan Lal, Roshan Di Kulfi, Sitaram Bazaar",
      "price": "₹60-200"
    },
    {
      "name": "Jalebi",
      "description": "Old Famous Jalebi Wala's jalebis have legendary status since 1884—perfect spiral shape, crispy exterior, syrup-soaked interior. Made by piping fermented batter into hot ghee in concentric circles, then dunking in saffron-cardamom sugar syrup. Best consumed hot when contrast between crispy and juicy is most pronounced. Winter tradition of jalebi with rabri creates hot-cold, crispy-creamy combination.",
      "whereToTry": "Old Famous Jalebi Wala, Jalebi Junction, Natraj Dahi Bhalle Wala",
      "price": "₹40-100 per plate"
    },
    {
      "name": "Momos",
      "description": "Though Tibetan in origin, momos have become so integral to Delhi that the city probably consumes more than Tibet and Nepal combined. From basic steamed version with watery chutney at street corners to gourmet versions with truffle oil at cafes, Delhi embraced and evolved this dumpling. Tandoori momos—a Delhi invention where steamed momos are grilled in tandoor—represents the city's ability to transform any cuisine.",
      "whereToTry": "Yeti, QD's, GK2 M Block Market, Street vendors everywhere",
      "price": "₹40-150"
    }
  ],
  "travelTips": [
    "Delhi Metro is your lifeline - download DMRC app, buy tourist card (₹200/day unlimited) at any station to avoid queues. Yellow Line connects major tourist spots.",
    "Pre-paid taxi counters at airport/railway stations prevent overcharging - insist on them despite driver protests about 'knowing shortcuts'.",
    "Uber/Ola work well but in Old Delhi's narrow lanes, cycle rickshaws are only option - negotiate fare beforehand (₹20-50 for short distances).",
    "Visit monuments early morning (many open at sunrise) to avoid crowds and heat.",
    "October to March is ideal - December/January can be very cold (3-5°C) and foggy. Avoid April to June when temps hit 45°C.",
    "Pollution peaks November-December during crop burning - carry N95 masks if you have respiratory issues.",
    "Street food is generally safe at busy stalls with high turnover - avoid pre-cut fruits and salads. Stick to bottled water.",
    "Dress modestly at religious places - cover shoulders/knees, remove shoes. Photography banned inside many monuments.",
    "Connaught Place/Paharganj - budget to mid-range, central location. South Delhi - upscale, safe, great cafes but far from historical sites.",
    "Bargaining expected at markets except malls - start at 40% of asking price.",
    "Common scams: fake travel agents at railway station, overpriced 'government' handicraft shops, closed monument redirects to commission shops.",
    "Delhi is generally safe but stay alert - avoid isolated areas after 9 PM. Tourist police stationed at major monuments.",
    "Download 'Himmat' app - Delhi Police safety app with SOS feature.",
    "Mehrauli Archaeological Park has 100+ monuments in forest setting - free entry, no crowds.",
    "Nizamuddin Dargah Thursday evening qawwali sessions are spiritual experience - dress conservatively.",
    "Book heritage walks by INTACH online in advance - cover different neighborhoods.",
    "Budget ₹1,500-4,000 per day for mid-range comfort including hotel, food, transport, monuments."
  ],
  "budgetEstimate": "₹1,500 - ₹4,000 per day (mid-range budget)",
  "hiddenGems": [
    "Agrasen ki Baoli - 14th-century stepwell hidden in Connaught Place heart, 108 steps descending into earth creating dramatic shadows. Despite being 600 years old, largely forgotten until recent years. Wonderfully uncrowded.",
    "Hauz Khas Complex - Beyond trendy cafes, explore medieval ruins surrounding 14th-century water tank. Tomb of Firoz Shah Tughlaq sits on hill offering panoramic views. Early morning visits avoid party crowds. Deer sometimes wander through ruins.",
    "Mehrauli Archaeological Park - Sprawling 200-acre park with over 100 monuments from 10th to 19th centuries, yet largely undiscovered. Jamali Kamali Mosque with vibrant ceiling frescoes, haunting Balban's tomb ruins, Rajon ki Baoli stepwell. Unlike crowded Qutub Minar nearby, you might have entire monuments to yourself.",
    "Lodhi Art District - Delhi's first outdoor public art district features massive murals by Indian and international street artists covering apartment buildings. Wander residential streets to discover vibrant artwork transforming walls into open-air gallery.",
    "Nizamuddin Basti - Medieval settlement around Sufi saint's dargah is living heritage area unchanged for centuries. Narrow lanes hold bookbinders, calligraphers, kebab sellers. Thursday evening qawwali creates transcendent atmosphere. Karim's and Ghalib Kabab Corner serve legendary Mughlai food.",
    "Sunder Nursery - Beautifully restored 90-acre Mughal garden complex next to Humayun's Tomb, featuring 15 heritage monuments. Opened to public only in 2018 after decades of restoration. Butterfly conservatory and heritage trails make it perfect for peaceful afternoon.",
    "Majnu ka Tilla (Little Tibet) - Tibetan refugee colony feeling transported from Dharamsala. Colorful prayer flags over narrow lanes packed with Tibetan restaurants, shops selling handicrafts, monasteries where monks conduct prayers. Authentic Tibetan culture in Delhi's heart. Food is exceptional.",
    "Gurudwara Bangla Sahib Kitchen - The massive community kitchen (langar) serves 10,000 free meals daily to anyone regardless of religion. Volunteer for a few hours washing dishes or serving food to understand Sikhism's emphasis on selfless service. The synchronized efficiency of preparing meals for thousands is mesmerizing."
  ],
  "faq": [
    {
      "question": "Which is the most visited place in Delhi?",
      "answer": "Red Fort and India Gate are the big ones - everyone and their uncle goes there. Red Fort especially gets crazy crowded on weekends. But honestly? The metro during office hours might win this one. Jokes aside, Connaught Place is probably the most visited spot because it's central, has everything, and everyone passes through at some point. Lotus Temple is also super popular, especially with domestic tourists."
    },
    {
      "question": "What to do for 1 day in Delhi?",
      "answer": "Start early at Humayun's Tomb (it's beautiful and less crowded in the morning). Quick stop at India Gate for photos. Hit Chandni Chowk for breakfast paranthas at Paranthe Wali Gali. Explore the lanes, see Jama Masjid. Afternoon at Qutub Minar. Evening at Connaught Place - walk around, grab dinner, maybe check out Khan Market. If you've got energy left, drive past Rashtrapati Bhavan at night when it's lit up. You'll be exhausted but you'll have seen Delhi."
    },
    {
      "question": "How to cover Delhi in 3 days?",
      "answer": "Day 1: Old Delhi - Red Fort, Jama Masjid, Chandni Chowk food walk, Raj Ghat. Day 2: New Delhi - India Gate, Lotus Temple, Humayun's Tomb, Qutub Minar. Day 3: Mix it up - Akshardham (if you're into temples), Hauz Khas Village (cafes and ruins), maybe Lodhi Gardens for a chill morning. This covers historical Delhi, modern Delhi, and hipster Delhi. Pro tip: Use metro for everything - traffic will kill you otherwise."
    },
    {
      "question": "Where to go in Delhi for 2 days?",
      "answer": "Day 1: Hit the big ones - Humayun's Tomb, India Gate, Connaught Place, maybe Qutub Minar if you have time. Day 2: Old Delhi morning (Jama Masjid, Chandni Chowk, breakfast at Karim's), then Lotus Temple, end at Hauz Khas Village for evening. Skip Akshardham unless you're really into temples - it'll eat up 3-4 hours. Focus on what you really want to see because Delhi's huge and traffic is brutal."
    },
    {
      "question": "What are the hidden places to visit near Delhi?",
      "answer": "Agrasen ki Baoli - this ancient stepwell is right in the middle of the city but nobody goes there. Mehrauli Archaeological Park has over 100 monuments and you'll probably be alone. Sunder Nursery next to Humayun's Tomb is gorgeous and peaceful. Majnu ka Tilla (Little Tibet) for Tibetan food and culture. Nizamuddin Basti on Thursday evening for qawwali - it's magical. Lodhi Art District if you're into street art. These places won't be in typical tourist itineraries but they're worth it."
    },
    {
      "question": "Which is the VIP area in Delhi?",
      "answer": "Lutyens' Delhi - that's where all the politicians, bureaucrats, and diplomats live. Think big bungalows with massive gardens. Golf Links and Jor Bagh are super posh. Then you've got newer money areas like Greater Kailash, Defence Colony, Vasant Vihar - big houses, expensive cars, malls nearby. Gurgaon's DLF areas are where corporate folks and NRIs have their penthouses. But honestly, Delhi's VIP culture is more about who you know than where you live!"
    },
    {
      "question": "Where can I go with my girlfriend in Delhi?",
      "answer": "Lodhi Gardens is classic - nice walk, peaceful, lots of couples hang out there. Hauz Khas Village for cafes and the lake view. Garden of Five Senses in Mehrauli is beautiful and not too crowded. Kingdom of Dreams if you want a Bollywood cultural show. Deer Park in Hauz Khas if she likes nature. For dinner, Cyber Hub in Gurgaon or Khan Market have good options. Or just walk around India Gate in the evening - it's romantic and well-lit. Delhi's pretty chill about couples, especially in South Delhi areas."
    },
    {
      "question": "Which is the coldest place near Delhi?",
      "answer": "Delhi itself gets pretty damn cold in December-January (we're talking 4-5°C some mornings). But if you want actual hills and colder weather, Mussoorie is your closest bet at 290 km (6-7 hours). Nainital is also around the same distance. Shimla is a bit further but worth it if you want proper cold. In winter, these places can get snow. If you just want to escape Delhi's heat in summer, even Kasauli or Solan work - they're closer and cooler. But 'near' Delhi means you're looking at 6-8 hours minimum for any real cold."
    },
    {
      "question": "Where can I get privacy with my girlfriend in Delhi?",
      "answer": "Lodhi Gardens has quiet corners, especially on weekday mornings. Sunder Nursery is less crowded than most places. Get a table at a cafe in Hauz Khas Village or Khan Market - people mind their own business. Book a room at a decent hotel - places in South Delhi, Connaught Place, or even Aerocity don't hassle couples. Just carry IDs. Deer Park in Hauz Khas Village works too. Early morning at India Gate before the crowds. Or drive to Kingdom of Dreams area in Gurgaon - the whole area is more modern and accepting."
    },
    {
      "question": "What are some romantic getaways near Delhi?",
      "answer": "Neemrana Fort (2 hours) is perfect - heritage hotel with zip-lining, pools, and royal vibes. Agra for the Taj Mahal is obvious but works (3-4 hours). Rishikesh if you're into adventure and spirituality (5-6 hours). Jim Corbett for wildlife and resorts (5-6 hours). Mussoorie for hills and walks (6-7 hours). If you can spare just a day, even Damdama Lake (hour away) has nice resorts. Weekend trips? Jaipur works - palaces, forts, good food (5 hours). Book a heritage hotel and you're set. Just avoid going on long weekends - everyone from Delhi has the same idea!"
    }
  ]
}
